# Parameter Filter Rule Factory Create Greater Rule Method

Source: https://www.revitapidocs.com/2026/3885f1a1-d26c-a3c3-54e1-81f75c04148a.htm

---

| Parameter Filter Rule Factory Create Greater Rule Method |
| --- |

Overload List

|  | Name | Description |
| --- | --- | --- |
|  | CreateGreaterRule(ElementId, ElementId) | Creates a filter rule that determines whether ElementId values  from the document are greater than a certain value. |
|  | CreateGreaterRule(ElementId, Int32\) | Creates a filter rule that determines whether integer values  from the document are greater than a certain value. |
|  | CreateGreaterRule(ElementId, String) | Creates a filter rule that determines whether strings from the document are greater than a certain value. |
|  | CreateGreaterRule(ElementId, Double, Double) | Creates a filter rule that determines whether double\-precision values  from the document are greater than a certain value. |

Top See Also

#### Reference

ParameterFilterRuleFactory Class Autodesk.Revit.DB Namespace